Revit 2024 API
UIApplication.OpenAndActivateDocument Method
Overload List
Name | Description
OpenAndActivateDocument(String)
 Opens and activates a Revit document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean)
 Opens and activates a Revit document, include both local document or cloud document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean, IOpenFromCloudCallback)
 Opens and activates a Revit document, include both local document or cloud document.
See Also
UIApplication Class
UIApplication Members
Autodesk.Revit.UI Namespace